zaikou/msp430-launchpad-WiredSRM-ANTpuls-Converter/UnQo_TX_20131118_github_main.c
//******************************************************************************
//  MSP430G2xx3 Demo - Timer_A, Ultra-Low Pwr UART 9600 Echo, 32kHz ACLK
//
//  Description: Use Timer_A CCR0 hardware output modes and SCCI data latch
//  to implement UART function @ 9600 baud. Software does not directly read and
//  write to RX and TX pins, instead proper use of output modes and SCCI data
//  latch are demonstrated. Use of these hardware features eliminates ISR
//  latency effects as hardware insures that output and input bit latching and
//  timing are perfectly synchronised with Timer_A regardless of other
//  software activity. In the Mainloop the UART function readies the UART to
//  receive one character and waits in LPM3 with all activity interrupt driven.
//  After a character has been received, the UART receive function forces exit
//  from LPM3 in the Mainloop which configures the port pins (P1 & P2) based
//  on the value of the received byte (i.e., if BIT0 is set, turn on P1.0).

//  ACLK = TACLK = LFXT1 = 32768Hz, MCLK = SMCLK = default DCO
//  //* An external watch crystal is required on XIN XOUT for ACLK *//
//
//               MSP430G2xx3
//            -----------------
//        /|\|              XIN|-
//         | |                 | 32kHz
//         --|RST          XOUT|-
//           |                 |
//           |   CCI0B/TXD/P1.1|-------->
//           |                 | 4800 8N1    //9600 8N1
//           |   CCI0A/RXD/P1.2|<--------
//
//
//  D. Dang
//  Texas Instruments Inc.
//  December 2010
//   Built with CCS Version 4.2.0 and IAR Embedded Workbench Version: 5.10
//******************************************************************************







//******************************************************************************
//P1.1TXD
//P1.2RXD
//P1.3=mode change switch
//P2.0=cadence capture
//P2.2=torque capture
//
//you need ANT NETWORK_ID at ANTAP1_AssignNetwork()
//visit this is transient com and make free acount!
//goloveski
//******************************************************************************


//#include "msp430g2452.h"
#include <stdint.h>
#include "msp430g2553.h"

//------------------------------------------------------------------------------
// Hardware-related definitions
//------------------------------------------------------------------------------
#define UART_TXD   0x02                     // TXD on P1.1 (Timer0_A.OUT0)
#define UART_RXD   0x04                     // RXD on P1.2 (Timer0_A.CCI1A)

//------------------------------------------------------------------------------
// Conditions for 9600 Baud SW UART, SMCLK = 1MHz
//------------------------------------------------------------------------------
//#define UART_TBIT_DIV_2     (1000000 / (9600 * 2))
//#define UART_TBIT           (1000000 / 9600)

#define UART_TBIT_DIV_2     (1000000 / (4800 * 2))
#define UART_TBIT           (1000000 / 4800)

#define kPeriod      0x2465 // 32768/37268*4=4Hz -> capture torque tickets
//------------------------------------------------------------------------------
// Global variables used for full-duplex UART communication
//------------------------------------------------------------------------------
unsigned int txData;                        // UART internal variable for TX
unsigned char rxBuffer;                     // Received UART character
const char string1[] = { "Hello World\r\n" };
unsigned int i;

//------------------------------------------------------------------------------
// Function prototypes
//------------------------------------------------------------------------------
void TimerA_UART_init(void);
void TimerA_UART_tx(unsigned char byte);
void TimerA_UART_print(char *string);

void Timer1_A_period_CAL_init(void);
void Timer1_A_period_init(void);

//------------------------------------------------------------------------------
// ANT Data
//------------------------------------------------------------------------------
#define MESG_NETWORK_KEY_ID      0x46
#define MESG_NETWORK_KEY_SIZE       9
#define ANT_CH_ID    0x00
#define ANT_CH_TYPE  0x10     //Master (0x10)
#define ANT_NET_ID   0x00
#define ANT_DEV_ID1  0x31     //49
#define ANT_DEV_ID2  0x00
#define ANT_DEV_TYPE 0x0B     // Device Type, HRM=0x78, Power=0x0B(11)
#define ANT_TX_TYPE  0x05     //ANT+ devices follow the transmission type definition as outlined in the ANT protocol.
#define ANT_CH_FREQ  0x0039   //   2457MHz
#define ANT_CH_PER   0x1FF6  //0x1FF6 8182/32768=4.004888780Hz // 0x1FA6 8102/32768=4.044Hz  8192/32768=4Hz

//Pedal Power define
#define Power_data   0x012C   // 012C=300W

//Standard Crank Torque data define
#define crank_period   0x0580   // 0x555 : 2048 / 1365 * 60  90rpm  max 0x10000 <
#define crank_torque   0x0420   // 1/32Nm 0x10000 <

//Crank Torque Frequency data define
#define ctf_time_stamp   0x0580   //
#define ctf_torque_ticks 0x0420   //

typedef uint8_t uchar;
uchar txBuffer[32];
uint8_t txBufferSize;
uint8_t txBufferPos;

unsigned int new_cap=0;
unsigned int old_cap=0;
unsigned int cap_diff=0;

unsigned int diff_array[16];                // RAM array for differences
unsigned int capture_array[16];             // RAM array for captures
unsigned int index=0;
unsigned int count = 0;

unsigned int new_pulse=0;
unsigned int old_pulse=0;
unsigned int pulse_diff=0;
unsigned int PulseTicket=0;
unsigned int PulseTicket_carry=0;
unsigned int PulseTicket_array[16];             // RAM array for PulseTicket
unsigned int PulseTicket_diff_array[16];        // RAM array for PulseTicket

uint16_t ctf_time_stamp1;
uint16_t ctf_torque_ticks1;
uint8_t Rotation_event_counter;

enum{
	CTMMODE = 1,
	OFFSETMODE
};

int unqomode = CTMMODE;         // for mode changer 1=CTM mode 2=OFFSET mode


//------------------------------------------------------------------------------
//  TX: sync+data+sum+CR+LF
//------------------------------------------------------------------------------

void txMessage(uchar* message,uint8_t messageSize)
{
  uint8_t i;
  _BIC_SR(GIE);  // disable interrupt

        txBufferPos  = 0;                                                           // set position to 0
        txBufferSize = messageSize + 3;         // message plus syc, size and checksum
        txBuffer[0]  = 0xa4;                                                         // sync byte
        txBuffer[1]  = (uchar) messageSize - 1;                // message size - command size (1)

  for(i=0; i<messageSize; i++)
    txBuffer[2+i] = message[i];

        // calculate the checksum
       txBuffer[txBufferSize - 1] = 0; //add
        for(i=0; i<txBufferSize - 1; ++i)
                txBuffer[txBufferSize - 1] = txBuffer[txBufferSize - 1] ^ txBuffer[i];

   _BIS_SR(GIE);   // enable interrupt

  // now send via UART
  for(i=0; i<txBufferSize; i++)
          TimerA_UART_tx(txBuffer[i]);
}

//------------------------------------------------------------------------------
//  ANT Data
//------------------------------------------------------------------------------

