zaikou/msp430-launchpad-WiredSRM-ANTpuls-Converter/UnQo_TX_20131118_github_main.c
// Resets module
void reset()
{
        uchar setup[2];
        setup[0] = 0x4a; // ID Byte
        setup[1] = 0x00; // Data Byte N (N=LENGTH)
        txMessage(setup, 2);
}


void ANTAP1_AssignNetwork()
{
        uchar setup[10];

    setup[0] = MESG_NETWORK_KEY_ID;
    setup[1] = ANT_CH_ID; // chan
    setup[2] = 0x00; //NETWORK_KEY_ID
    setup[3] = 0x00;
    setup[4] = 0x00;
    setup[5] = 0x00;
    setup[6] = 0x00;
    setup[7] = 0x00;
    setup[8] = 0x00;
    setup[9] = 0x00;
        txMessage(setup, 10);
}


// Assigns CH=0, CH Type=10(TX), Net#=0
void assignch()
{
        uchar setup[4];
        setup[0] = 0x42;
        setup[1] = ANT_CH_ID;    // Channel ID
        setup[2] = ANT_CH_TYPE;  // CH Type
        setup[3] = ANT_NET_ID;   // Network ID
        txMessage(setup, 4);
}

// set RF frequency
void setrf()
{
        uchar setup[3];
        setup[0] = 0x45;
        //setup[1] = (ANT_CH_FREQ & 0xFF00) >> 8;
        //setup[2] = (ANT_CH_FREQ & 0xFF);    // RF Frequency
        setup[1] = ANT_CH_ID;    // Channel ID
        setup[2] = 0x39;    // RF Frequency
        txMessage(setup, 3);
}

// set channel period
void setchperiod()
{
        uchar setup[4];
        setup[0] = 0x43;
        setup[1] = ANT_CH_ID;
        setup[2] = (ANT_CH_PER & 0xFF);  //Channel Period LSB
        setup[3] = ((ANT_CH_PER & 0xFF00) >> 8);   // Channel Period MSB
        txMessage(setup, 4);
}

// Assigns CH#, Device#=0000, Device Type ID=00, Trans Type=00
void setchid()
{
        uchar setup[6];
        setup[0] = 0x51;
        setup[1] = ANT_CH_ID;      // Channel Number, 0x00 for HRM
        setup[2] = ANT_DEV_ID1;    // Device Number LSB
        setup[3] = ANT_DEV_ID2;    // Device Number MSB
        setup[4] = ANT_DEV_TYPE;   // Device Type, 0x78 for HRM
        setup[5] = ANT_TX_TYPE;
        txMessage(setup, 6);
}

/////////////////////////////////////////////////////////////////////////
// Priority:
//
// ucPower_:   0 = TX Power -20dBM
//             1 = TX Power -10dBM
//             2 = TX Power -5dBM
//             3 = TX Power 0dBM
//
/////////////////////////////////////////////////////////////////////////
/*
void ChannelPower()
{
        uchar setup[3];
        setup[0] = 0x47;
        setup[1] = 0x00;
        setup[2] = 0x03;


        txMessage(setup, 3);
}
*/

// Opens CH 0
void opench()
{
        uchar setup[2];
        setup[0] = 0x4b;
        setup[1] = ANT_CH_ID;
        txMessage(setup, 2);
}


// Sends sendPower_n
void sendPower_n(uchar num)
{
        uchar setup[10];
        setup[0] = 0x4e;     //broadcast data
        setup[1] = ANT_CH_ID;     //
        setup[2] = 0x10;     // 0x10 Data Page Number
        setup[3] = num;      //Event Count max256
        setup[4] = 0xB8;     //Pedal Power 0xFF > pedal power not used
        setup[5] = 0x5F;     //Instantaneous Cadence 0x5A=90
        setup[6] =  (0xFF & (Power_data * num ));     //Accumulated Power LSB
        setup[7] = ((0xFF00 & (Power_data * num)) >>8);     //Accumulated Power MSB
        setup[8] = (0xFF & Power_data);      //Instantaneous Power LSB
        setup[9] = ((0xFF00 & Power_data) >>8);       //Instantaneous Power MSB
        txMessage(setup, 10);
}

// Sends sendPower_SCT
void sendPower_SCT(uchar num)
{
        uchar setup[10];
        setup[0] = 0x4e;									//broadcast data
        setup[1] = ANT_CH_ID;								// 0x41;     //
        setup[2] = 0x12;									// 0x12 Data Page Number Standard Crank Torque
        setup[3] = num;										//Event Count max 256
        setup[4] = num;										// Crank Revolutions
        setup[5] = 0xFF;									//Crank cadence  if available 0x5A=90 Otherwise: 0xFF
        setup[6] =  (0xFF & (crank_period * num ));			//Accumulated crank period LSB
        setup[7] = ((0xFF00 & (crank_period * num)) >>8);	//Accumulated crank period MSB
        setup[8] = (0xFF & crank_torque* num);				//Accumulated torque LSB
        setup[9] = ((0xFF00 & crank_torque* num) >>8);		//Accumulated torque MSB
        txMessage(setup, 10);
}


// Sends sendPower_CTF1
void sendPower_CTF1()
{
        uchar setup[10];
        setup[0] = 0x4e;									//broadcast data
        setup[1] = ANT_CH_ID;								// 0x41;     //
        setup[2] = 0x20;									// 0x20 Data Page Number Crank Torque Frequency
        setup[3] = Rotation_event_counter;					//Rotation event counter increments with each completed pedal revolution.
        setup[4] = 0x32;									// Slope MSB 1/10 Nm/Hz
        setup[5] = 0x32;									// Slope LSB 1/10 Nm/Hz
        setup[6] = ((0xFF00 & (ctf_time_stamp1)) >>8);      //Accumulated Time Stamp MSB 1/2000s
        setup[7] = (0xFF & (ctf_time_stamp1));				//Accumulated Time Stamp LSB 1/2000s
        setup[8] = ((0xFF00 & ctf_torque_ticks1) >>8);		//Accumulated Torque Ticks Stamp MSB
        setup[9] = (0xFF & ctf_torque_ticks1);				//Accumulated Torque Ticks Stamp LSB
        txMessage(setup, 10);
}

// Sends sendPower_CTF1_Calibration
void sendPower_CTF1_CAL()
{
        uchar setup[10];
        setup[0] = 0x4e;      //broadcast data
        setup[1] = ANT_CH_ID; // 0x41;     //
        setup[2] = 0x01;      // Data page Number : Calibration massage
        setup[3] = 0x10;      // Calibration ID : CTF defined massage
        setup[4] = 0x01;      // CTF Defined ID : Zero offset
        setup[5] = 0xFF;      // Reserved :
        setup[6] = 0xFF;      // Reserved :
        setup[7] = 0xFF;      // Reserved :
        setup[8] = ((0xFF00 & ctf_torque_ticks1) >>8);     //Offset MSB
        setup[9] = (0xFF & ctf_torque_ticks1);        //Offset LSB
        txMessage(setup, 10);
}

unsigned int calc_time_diff(int end_t,int start_t)
{
	if(end_t >= start_t)
		return((unsigned int)(end_t - start_t));
	else
		return((unsigned int)((0xffff - start_t) + 1 + end_t));
}


//------------------------------------------------------------------------------
// main()
//------------------------------------------------------------------------------
void main(void)

{

    WDTCTL = WDTPW + WDTHOLD;               // Stop watchdog timer

    DCOCTL = 0x00;                          // Set DCOCLK to 1MHz
    BCSCTL1 = CALBC1_1MHZ;
    DCOCTL = CALDCO_1MHZ;

    BCSCTL1 |= DIVA_3;                        // ACLK/8


    P1OUT = 0x00;                           // Initialize all GPIO
    P1SEL = UART_TXD + UART_RXD;            // Timer function for TXD/RXD pins
    P1DIR = 0xFF & ~UART_RXD;               // Set all pins but RXD to output

