zaikou/msp430-launchpad-WiredSRM-ANTpuls-Converter/UnQo_TX_20131118_github_main.c
    P1DIR &= ~BIT3;
    P1REN |= BIT3;
    P1OUT |= BIT3;
    P1IES |= BIT3;                // H -> L edge
    P1IE  |= BIT3;                // enable interrupt

    P1DIR |=  BIT6;
    P1OUT &= ~BIT6;

//    P2OUT = 0x00;                           // Initialize all GPIO
//    P2SEL = 0x00;
//    P2DIR = 0xFF;

// for ticket measurement
//    P1DIR = BIT0;                             // Set P1.0 out,1.1 input dir
//    P1OUT &= ~BIT0;                           // LED off
//    P1SEL = BIT1;                             // Set P1.1 to TA0

    P2OUT = 0x00;                           // Initialize all GPIO
    P2DIR &= ~ BIT0;                             // P2.0 set to TimerA_A3.CCI0A
    P2SEL |= BIT0;



// 2.2 pin for pulse ticket capture
    P2DIR &= ~BIT2;
    P2REN |= BIT2;
    P2OUT |= BIT2;
    P2IES |= BIT2;                // H -> L edge
    P2IE  |= BIT2;                // enable interrupt

    PulseTicket = 0x00;

    __enable_interrupt();

    TimerA_UART_init();                     // Start Timer_A UART

    Timer1_A_period_init();

    //__delay_cycles(5000);                  // Delay between comm cycles


// ANT chip configuration
    reset();
    //P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    //P1OUT &= ~BIT0;
    //__delay_cycles(5000);

    ANTAP1_AssignNetwork();
    //P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    //P1OUT &= ~BIT0;
    //__delay_cycles(5000);

    assignch();
    //P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    //P1OUT &= ~BIT0;
    //__delay_cycles(5000);

    setrf();
    //P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    //P1OUT &= ~BIT0;
    //__delay_cycles(5000);

    setchperiod();
    //P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    //P1OUT &= ~BIT0;
    //__delay_cycles(5000);

    setchid();
    //P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    //P1OUT &= ~BIT0;
    //__delay_cycles(5000);

//    ChannelPower();
//    P1OUT |= BIT0;
//     __delay_cycles(5000);                  // Delay between comm cycles
//     P1OUT &= ~BIT0;
//     __delay_cycles(5000);


    opench();
    //P1OUT |= BIT0;
    __delay_cycles(5000);                  // Delay between comm cycles
    //P1OUT &= ~BIT0;
    //__delay_cycles(5000);

  __delay_cycles(5000);                  // Delay between comm cycles



}

//------------------------------------------------------------------------------
// PORT1 mode change capture P1.3
//------------------------------------------------------------------------------

#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void)
{
    //P1OUT ^= BIT6;   // LED Toggle P1.6 using exclusive-OR
    P1OUT ^= BIT0;   // LED Toggle P1.0 using exclusive-OR
    P1IFG &= ~BIT3;   // clear flag

	/*need chattering timer?*/

    if(unqomode >= OFFSETMODE)
		unqomode = CTMMODE;
    else
        unqomode = OFFSETMODE;

    if(unqomode == CTMMODE)
    {
		Timer1_A_period_init();                // Timer set CTM mode
        _NOP();      			               // SET BREAKPOINT HERE
        //P1OUT = BIT1;
        //__delay_cycles(5000);                // Delay between comm cycles
        //P1OUT &= ~BIT1;
	}
	else
	{
		Timer1_A_period_CAL_init();            // Timer set CAL mode
		_NOP();                                // SET BREAKPOINT HERE
        //P1OUT = BIT1;
        // __delay_cycles(5000);                  // Delay between comm cycles
        //P1OUT &= ~BIT1;
    }
}

//------------------------------------------------------------------------------
// PORT2 ticket capture P2.2
//------------------------------------------------------------------------------
#pragma vector=PORT2_VECTOR
__interrupt void Port_2(void)
{
	//P1OUT ^= BIT6;   // LED Toggle P1.6 using exclusive-OR
	P2IFG &= ~BIT2;   // clear flag

	if (PulseTicket >= 0xFFFF)
	{
		PulseTicket = 0;
		PulseTicket_carry++;
	}
	else
		PulseTicket++;    //Counter

	 _NOP();
}

//------------------------------------------------------------------------------
// Timer_A cadence capture P2.0
//------------------------------------------------------------------------------
#pragma vector=TIMER1_A0_VECTOR
__interrupt void TIMER1_A0(void)
{
    Rotation_event_counter++;

    ctf_torque_ticks1 = new_pulse = PulseTicket;

	PulseTicket = 0;									// added for reset

	pulse_diff = new_pulse - old_pulse;
	PulseTicket_diff_array[index] = (int)pulse_diff;
//	PulseTicket_array[index] = new_pulse;

    if(unqomode == CTMMODE)
    {
         P1OUT ^= BIT6;                         // Toggle P1.6 using exclusive-OR
         new_cap = TA1CCR0;                     // TIMER_A0->TIMER1_A0, TACCR0->TA1CCR0
         ctf_time_stamp1 = (TA1CCR0 / 2);
         cap_diff = calc_time_diff(new_cap,old_cap);
         diff_array[index] = cap_diff;          // record difference to RAM array
//       capture_array[index++] = new_cap;
         sendPower_CTF1();
         _NOP();                                // SET BREAKPOINT HERE
    }
    else										//OFFSETMODE
    {
         P1OUT &= ~BIT6;                        //LED OFF
         sendPower_CTF1_CAL();
         _NOP();                                // SET BREAKPOINT HERE
    }

   if(index >= 16)
   {
     index = 0;
     //P1OUT ^= BIT0;                         // Toggle P1.0 using exclusive-OR
   }

   old_pulse = new_pulse;
   old_cap = new_cap;                       // store this capture value

   count ++;

   if (count >= 16) //32->16
   {
		count = 0;
		_NOP();                                // SET BREAKPOINT HERE
   }

   if(Rotation_event_counter >= 0xFF)
   {
		Rotation_event_counter = 0x00;
   }
}


//------------------------------------------------------------------------------
// Function configures Timer1_A for CTM period capture
//------------------------------------------------------------------------------
void Timer1_A_period_init(void)
{
	TA1CCTL0 = CM_1 + SCS + CCIS_0 + CAP + CCIE; // Rising edge + Timer1_A3.CCI0A (P2.0)
                                                     // + Capture Mode + Interrupt
//	TACTL = TASSEL_2 + MC_2;                  // SMCLK + Continuous Mode
	TA1CTL = TASSEL_1 + MC_2;                  // ACLK + Continuous Mode
 }


 //------------------------------------------------------------------------------
 // Function configures Timer1_A for cal period capture
 //------------------------------------------------------------------------------
void Timer1_A_period_CAL_init(void)
{
//	TA1CCTL0 = CM_1 + SCS + CCIS_0 + CAP + CCIE; // Rising edge + Timer1_A3.CCI0A (P2.0)
                                                     // + Capture Mode + Interrupt

//	TACTL = TASSEL_2 + MC_2;                  // SMCLK + Continuous Mode
//	TA1CTL = TASSEL_1 + MC_2;                  // ACLK + Continuous Mode
	TA1CTL = TASSEL_1 + MC_1; // + TAIE;           // ACLK, UP mode, interrupt
	TA1CCR0 = kPeriod;
	TA1CCTL0 |= CCIE;              // enable interrupt
}

//------------------------------------------------------------------------------
// Function configures Timer_A for full-duplex UART operation
//------------------------------------------------------------------------------
void TimerA_UART_init(void)
{
    TACCTL0 = OUT;                          // Set TXD Idle as Mark = '1'
    TACCTL1 = SCS + CM1 + CAP + CCIE;       // Sync, Neg Edge, Capture, Int
    TACTL = TASSEL_2 + MC_2;                // SMCLK, start in continuous mode
}
//------------------------------------------------------------------------------
// Outputs one byte using the Timer_A UART
//------------------------------------------------------------------------------
void TimerA_UART_tx(unsigned char byte)
{
    while (TACCTL0 & CCIE);                 // Ensure last char got TX'd
    TACCR0 = TAR;                           // Current state of TA counter
    TACCR0 += UART_TBIT;                    // One bit time till first bit
    TACCTL0 = OUTMOD0 + CCIE;               // Set TXD on EQU0, Int
    txData = byte;                          // Load global variable
    txData |= 0x100;                        // Add mark stop bit to TXData
    txData <<= 1;                           // Add space start bit
}

//------------------------------------------------------------------------------
// Prints a string over using the Timer_A UART
//------------------------------------------------------------------------------
void TimerA_UART_print(char *string)
{
    while (*string)
    {
        TimerA_UART_tx(*string++);
    }
}
//------------------------------------------------------------------------------
// Timer_A UART - Transmit Interrupt Handler
//------------------------------------------------------------------------------
#pragma vector = TIMER0_A0_VECTOR
__interrupt void Timer_A0_ISR(void)
{
    static unsigned char txBitCnt = 10;

    TACCR0 += UART_TBIT;                    // Add Offset to CCRx
    if (txBitCnt == 0) {                    // All bits TXed
        TACCTL0 &= ~CCIE;                   // All bits TXed, disable interrupt
        txBitCnt = 10;                      // Re-load bit counter
    }
    else {
        if (txData & 0x01) {
          TACCTL0 &= ~OUTMOD2;              // TX Mark '1'
        }
        else {
          TACCTL0 |= OUTMOD2;               // TX Space '0'
        }
        txData >>= 1;
        txBitCnt--;
    }
}
//------------------------------------------------------------------------------
// Timer_A UART - Receive Interrupt Handler
//------------------------------------------------------------------------------
#pragma vector = TIMER0_A1_VECTOR
__interrupt void Timer_A1_ISR(void)
{
    static unsigned char rxBitCnt = 8;
    static unsigned char rxData = 0;

    switch (__even_in_range(TA0IV, TA0IV_TAIFG)) { // Use calculated branching
        case TA0IV_TACCR1:                        // TACCR1 CCIFG - UART RX
            TACCR1 += UART_TBIT;                 // Add Offset to CCRx
            if (TACCTL1 & CAP) {                 // Capture mode = start bit edge
                TACCTL1 &= ~CAP;                 // Switch capture to compare mode
                TACCR1 += UART_TBIT_DIV_2;       // Point CCRx to middle of D0
            }
            else {
                rxData >>= 1;
                if (TACCTL1 & SCCI) {            // Get bit waiting in receive latch
                    rxData |= 0x80;
                }
                rxBitCnt--;
                if (rxBitCnt == 0) {             // All bits RXed
                    rxBuffer = rxData;           // Store in global variable
                    rxBitCnt = 8;                // Re-load bit counter
                    TACCTL1 |= CAP;              // Switch compare to capture mode
                    __bic_SR_register_on_exit(LPM0_bits);  // Clear LPM0 bits from 0(SR)
                }
            }
            break;
    }
}
